IdeaRS.Connections
GeneralPlateData Class
Compatible with IDEA StatiCa 0.0
 Represents data for the command which creates the generally located plate.
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.GeneralPlateData
 IdeaRS.Connections.Data.MemberLongitudinalStiffenerData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class GeneralPlateData : PlateDataBase
The GeneralPlateData type exposes the following members.
Constructors
Name | Description
GeneralPlateData
 Constructor
Top
Properties
Name | Description
CoordSystem
 Data of the local coordinate system - Origin, AxisX, AxisY, AxisZ
CustomGeometry
 Gets or sets the custom geometrical data
IsActive |  (Inherited from ConnectionCmdData.)
LocIsWelded
LocJointPoint
LocJointRotation
LocLocation
LocMemberPath
LocPitch
LocPlatePath
LocRelatedTo
LocRotation
LocType
LocXposition
LocYposition
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
PlateEdgeInx
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
Shape
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
ShapeParam1
 Rectangle-B1, Circle-R
ShapeParam2
 Rectangle-B2
ShapeParam3
 Rectangle-H1
ShapeParam4
 Rectangle-H2
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Weld
 Gets or sets the properties of the connected member to plate weld
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace